In [1]:
import pandas as pd

In [37]:
df_credit = pd.read_csv('https://www.littledataman.com/samples/credit.csv', parse_dates = ['Approval Date'])
df_cards = pd.read_csv('https://www.littledataman.com/samples/cards.csv', parse_dates = ['Effective Date'])
df_transactions = pd.read_csv('https://www.littledataman.com/samples/transactions.csv', parse_dates = ['Date'])

In [4]:
df_credit.shape

(5, 7)

In [5]:
df_credit.info

<bound method DataFrame.info of   First Name Last Name  Credit Score  Credit Approval Card Name     Income  \
0      Jacky     White           825             True  Infinite  155000.62
1       Jane      Nize           810             True    Golden  120800.88
2      Henry      Tone           780             True    Golden   98000.58
3    Desmond     Black           750             True    Silver   54000.00
4     Eileen      Musk           620            False  Dividend   35000.00

        Approval Date
0 2019-09-13 12:00:00
1 2019-08-16 05:25:00
2 2020-05-06 12:00:00
3 2020-05-01 01:00:00
4                 NaT  >

In [7]:
df_credit.head()

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00
4,Eileen,Musk,620,False,Dividend,35000.00,NaT

In [9]:
df_credit.describe()

       Credit Score         Income
count       5.00000       5.000000
mean      757.00000   92560.416000
std        81.82298   48800.628682
min       620.00000   35000.000000
25%       750.00000   54000.000000
50%       780.00000   98000.580000
75%       810.00000  120800.880000
max       825.00000  155000.620000

In [12]:
df_credit.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00
4,Eileen,Musk,620,False,Dividend,35000.00,NaT

In [16]:
df_credit.set_index('Card Name', inplace=True)

KeyError: "None of ['Card Name'] are in the columns"

In [17]:
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
Card Name,,,,,,
Infinite,Jacky,White,825,True,155000.62,2019-09-13 12:00:00
Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
Golden,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00
Silver,Desmond,Black,750,True,54000.00,2020-05-01 01:00:00
Dividend,Eileen,Musk,620,False,35000.00,NaT

In [20]:
df_credit.index

Index(['Infinite', 'Golden', 'Golden', 'Silver', 'Dividend'], dtype='object', name='Card Name')

In [21]:
df_credit.reset_index(inplace=True)
df_credit.set_index(['First Name', 'Last Name'], inplace = True)

In [22]:
df_credit

,,Credit Score,Credit Approval,Income,Approval Date
First Name,Last Name,,,,
Jacky,White,825,True,155000.62,2019-09-13 12:00:00
Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
Henry,Tone,780,True,98000.58,2020-05-06 12:00:00
Desmond,Black,750,True,54000.00,2020-05-01 01:00:00
Eileen,Musk,620,False,35000.00,NaT

In [24]:
df_credit.loc[('Jacky', 'White'), :]

Credit Score                       825
Credit Approval                   True
Income                          155001
Approval Date      2019-09-13 12:00:00
Name: (Jacky, White), dtype: object

In [25]:
df_credit.loc[: , 'Credit Score']

First Name  Last Name
Jacky       White        825
Jane        Nize         810
Henry       Tone         780
Desmond     Black        750
Eileen      Musk         620
Name: Credit Score, dtype: int64

In [26]:
df_credit.reset_index(inplace=True)

In [27]:
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
0,Jacky,White,825,True,155000.62,2019-09-13 12:00:00
1,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
2,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00
3,Desmond,Black,750,True,54000.00,2020-05-01 01:00:00
4,Eileen,Musk,620,False,35000.00,NaT

In [28]:
df_credit['First Name']

0      Jacky
1       Jane
2      Henry
3    Desmond
4     Eileen
Name: First Name, dtype: object

In [29]:
df_credit.Income

0    155000.62
1    120800.88
2     98000.58
3     54000.00
4     35000.00
Name: Income, dtype: float64

In [30]:
df_credit[['First Name', 'Last Name', 'Credit Approval']]

  First Name Last Name  Credit Approval
0      Jacky     White             True
1       Jane      Nize             True
2      Henry      Tone             True
3    Desmond     Black             True
4     Eileen      Musk            False

In [31]:
s = df_credit['First Name']
s[1]

'Jane'

In [34]:
s[[1,4]]

1      Jane
4    Eileen
Name: First Name, dtype: object

In [35]:
df_credit[2:4]

,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
2,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00
3,Desmond,Black,750,True,54000.00,2020-05-01 01:00:00

In [38]:
df_credit.set_index( 'Card Name', inplace = True)
df_credit.loc['Golden',:]

,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
Card Name,,,,,,
Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
Golden,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00

In [39]:
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
Card Name,,,,,,
Infinite,Jacky,White,825,True,155000.62,2019-09-13 12:00:00
Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
Golden,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00
Silver,Desmond,Black,750,True,54000.00,2020-05-01 01:00:00
Dividend,Eileen,Musk,620,False,35000.00,NaT

In [40]:
df_credit.loc['Golden',['First Name', 'Last Name', 'Income', 'Approval Date']]

          First Name Last Name     Income       Approval Date
Card Name
Golden          Jane      Nize  120800.88 2019-08-16 05:25:00
Golden         Henry      Tone   98000.58 2020-05-06 12:00:00

In [41]:
df_credit.iloc[2,2]

780

In [42]:
df_credit.iloc[[0,2],[0,1,2]]

          First Name Last Name  Credit Score
Card Name
Infinite       Jacky     White           825
Golden         Henry      Tone           780

In [43]:
df_credit.iloc[0:2,:]

,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
Card Name,,,,,,
Infinite,Jacky,White,825,True,155000.62,2019-09-13 12:00:00
Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00

In [45]:
df_credit.reset_index(inplace=True)
df_credit.loc[df_credit['Card Name']=='Golden']

,Card Name,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
1,Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
2,Golden,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00

In [56]:
df_credit.loc[~(df_credit['Card Name']=='Golden')]

,Card Name,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
0,Infinite,Jacky,White,825,True,155000.62,2019-09-13 12:00:00
3,Silver,Desmond,Black,750,True,54000.00,2020-05-01 01:00:00
4,Dividend,Eileen,Musk,620,False,35000.00,NaT

In [48]:
df_credit['Card Name']=='Golden'

0    False
1     True
2     True
3    False
4    False
Name: Card Name, dtype: bool

In [50]:
df_credit.loc[(df_credit['Card Name']=='Golden') & (df_credit['Credit Score']>700)]

,Card Name,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
1,Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
2,Golden,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00

In [51]:
df_credit['Credit Score']>700

0     True
1     True
2     True
3     True
4    False
Name: Credit Score, dtype: bool

In [57]:
df_credit.loc[df_credit['Card Name']=='Golden', ['First Name','Last Name']]

  First Name Last Name
1       Jane      Nize
2      Henry      Tone

In [58]:
df_credit.loc[df_credit['Approval Date'].isnull()]

,Card Name,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
4,Dividend,Eileen,Musk,620,False,35000.0,NaT

In [59]:
pd.isnull(df_credit).any(axis=1)

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [60]:
pd.isnull(df_credit).any(axis=0)

Card Name          False
First Name         False
Last Name          False
Credit Score       False
Credit Approval    False
Income             False
Approval Date       True
dtype: bool

In [65]:
df_credit[pd.isnull(df_credit).any(axis=1)]

,Card Name,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
4,Dividend,Eileen,Musk,620,False,35000.0,NaT

In [66]:
df_credit[pd.notnull(df_credit).all(axis=1)]

,Card Name,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
0,Infinite,Jacky,White,825,True,155000.62,2019-09-13 12:00:00
1,Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
2,Golden,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00
3,Silver,Desmond,Black,750,True,54000.00,2020-05-01 01:00:00

In [67]:
df_credit

,Card Name,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
0,Infinite,Jacky,White,825,True,155000.62,2019-09-13 12:00:00
1,Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
2,Golden,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00
3,Silver,Desmond,Black,750,True,54000.00,2020-05-01 01:00:00
4,Dividend,Eileen,Musk,620,False,35000.00,NaT

In [68]:
df_credit.sort_values('Income')

,Card Name,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
4,Dividend,Eileen,Musk,620,False,35000.00,NaT
3,Silver,Desmond,Black,750,True,54000.00,2020-05-01 01:00:00
2,Golden,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00
1,Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
0,Infinite,Jacky,White,825,True,155000.62,2019-09-13 12:00:00

In [69]:
df_credit.sort_values('Income', ascending = False)

,Card Name,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
0,Infinite,Jacky,White,825,True,155000.62,2019-09-13 12:00:00
1,Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
2,Golden,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00
3,Silver,Desmond,Black,750,True,54000.00,2020-05-01 01:00:00
4,Dividend,Eileen,Musk,620,False,35000.00,NaT

In [70]:
df_credit.sort_values(['Credit Score', 'Income'] ,ascending = [True, False])

,Card Name,First Name,Last Name,Credit Score,Credit Approval,Income,Approval Date
4,Dividend,Eileen,Musk,620,False,35000.00,NaT
3,Silver,Desmond,Black,750,True,54000.00,2020-05-01 01:00:00
2,Golden,Henry,Tone,780,True,98000.58,2020-05-06 12:00:00
1,Golden,Jane,Nize,810,True,120800.88,2019-08-16 05:25:00
0,Infinite,Jacky,White,825,True,155000.62,2019-09-13 12:00:00